club_lucha_api/app/Controllers/Api/Auth.php

SELECT *
FROM `usuarios`
WHERE `email` = 'andujar@trainer.com'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `usuarios` SET `token` = '945350879a0e421ba81a626449746d75cbc2902bc9c2ee9968c071ed52202c76'
WHERE `usuarios`.`id` IN ('5')
---
    public function login()
    {

        $datos = $this->request->getJSON();
        $email = $datos->email;
        $password = $datos->password;


        $modelo = new UsuarioModel();
        $usuario = $modelo->where('email', $email)->first();

        // Comprobar si existe y si la contraseña es correcta
        if ($usuario == null || !password_verify($password, $usuario['password'])) {
            // Si falla, devolvemos error 401 (No autorizado)
            return $this->failUnauthorized('Usuario o contraseña incorrectos');
        }

        //Funcion para poder crear los token personalizados y no emplear jwt
        //bin2hex es una funcion que convierte una cadena de datos en una cadena de hexadecimales
        $nuevoToken = bin2hex(random_bytes(32));

        //Guardamos ese token en la base de datos del usuario
        $modelo->update($usuario['id'], ['token' => $nuevoToken]);