club_lucha_api/app/Controllers/Api/FichaDeportiva.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '4'
---
    public function show($id = null)
    {
        $userModel = new UsuarioModel();
        $usuario = $userModel->find($id);