club_lucha_api/app/Controllers/Api/Galeria.php

SELECT *
FROM `galeria`
---
    public function index()
    {
        // 1. Instanciamos el modelo
        $model = new GaleriaModel();

        // 2. Obtenemos TODAS las fotos
        // (Angular se encargará de filtrar si es ID 1 o ID 2)
        $data = $model->findAll();