club_lucha_api/app/Controllers/Api/Mensajes.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '4'
---
    public function index($userId = null)
    {
        if (!$userId) return $this->fail('Falta el ID del usuario en la URL');

        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->find($userId);

INSERT INTO `mensajes` (`remitente_id`, `destinatario_id`, `conversacion_id`, `cuerpo`, `tipo`) VALUES ('5', '3', '18', 'as', 'privado')
---
        $data['fecha_envio']     = date('Y-m-d H:i:s');
        $data['tipo']            = 'privado';

        if ($mensajeModel->insert($data)) {

SELECT `mensajes`.*, `u`.`nombre` as `nombre_remitente`
FROM `mensajes`
LEFT JOIN `usuarios` `u` ON `u`.`id` = `mensajes`.`remitente_id`
WHERE `conversacion_id` = '7'
ORDER BY `fecha_envio` ASC
---
    public function verConversacion($chatId = null)
    {
        if (!$chatId) return $this->fail('Falta ID conversación');

        $model = new MensajeModel();
        $mensajes = $model->select('mensajes.*, u.nombre as nombre_remitente')
                          ->join('usuarios u', 'u.id = mensajes.remitente_id', 'left')
                          ->where('conversacion_id', $chatId)
                          ->orderBy('fecha_envio', 'ASC')
                          ->findAll();

DELETE FROM `mensajes`
WHERE `conversacion_id` = '24'
---
    public function eliminarSala($chatId = null)
    {
        if (!$chatId) return $this->fail('Falta ID');

        $mensajeModel = new MensajeModel();
        $chatModel = new ConversacionModel();

        $mensajeModel->where('conversacion_id', $chatId)->delete();