club_lucha_api/app/Controllers/Api/Usuarios.php

    public function index()
    {
        $model = new UsuarioModel();
        $usuarios = $model->findAll();
---
SELECT *
FROM `usuarios`

    public function update($id = null)
    {
        $model = new UsuarioModel();

        // Verificamos que exista
        if (!$model->find($id)) {
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '7'

    public function delete($id = null)
    {
        $model = new UsuarioModel();

        if ($model->delete($id)) {
---
DELETE FROM `usuarios`
WHERE `id` IN ('8')