club_lucha_api/app/Models/InscripcionModel.php

    public function getAtletasInscritos($entrenamientoId)
    {
        return $this->select('inscripciones.*, u.nombre, u.apellidos, pa.foto_url')
                    ->join('usuarios u', 'u.id = inscripciones.usuario_id', 'inner')
                    ->join('perfiles_atletas pa', 'pa.usuario_id = u.id', 'left')
                    ->where('inscripciones.entrenamiento_id', $entrenamientoId)
                    ->findAll();
---
SELECT `inscripciones`.*, `u`.`nombre`, `u`.`apellidos`, `pa`.`foto_url`
FROM `inscripciones`
INNER JOIN `usuarios` `u` ON `u`.`id` = `inscripciones`.`usuario_id`
LEFT JOIN `perfiles_atletas` `pa` ON `pa`.`usuario_id` = `u`.`id`
WHERE `inscripciones`.`entrenamiento_id` = '7'